In [2]:
import pandas as pd

In [18]:
data=[10,20,30,40,50]
s=pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [58]:
s=pd.Series([12,23,34],index=["maths","english","science"])
print(s)
print("\n")

print(s.values)
print(s.index)
print(s.dtype)
print("\n")

print(s['maths'])
print(s[0])

maths      12
english    23
science    34
dtype: int64


[12 23 34]
Index(['maths', 'english', 'science'], dtype='object')
int64


12
12

C:\Users\HP PROBOOK RYZEN 7\AppData\Local\Temp\ipykernel_9436\3173343725.py:11: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

In [59]:
marks=pd.Series([10,20,30],index=["maths","english","hindi"])
print(marks)
print("\n")

print(marks**2) #any operation you can perform
print("\n")

print(marks>10) #returns in bool
print("\n")

print(marks[marks>10])#condition checking

maths      10
english    20
hindi      30
dtype: int64


maths      100
english    400
hindi      900
dtype: int64


maths      False
english     True
hindi       True
dtype: bool


english    20
hindi      30
dtype: int64

In [60]:
print(marks.sum())
print(marks.min())
print(marks.max())
print(marks.mean())
print(marks.describe())

60
10
30
20.0
count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [61]:
#pandas dataframe
data={
    "name": ["arnav","mavi"],
    "age": [10,10],
    "marks": [20,20]}
arr1=pd.DataFrame(data)
print(arr1)
print("\n")

print(arr1.shape)
print(arr1.columns)
print(arr1.dtypes) 
print("\n")
print(arr1.info())

    name  age  marks
0  arnav   10     20
1   mavi   10     20


(2, 3)
Index(['name', 'age', 'marks'], dtype='object')
name     object
age       int64
marks     int64
dtype: object


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
 2   marks   2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 180.0+ bytes
None

In [62]:
print(arr1["marks"])

0    20
1    20
Name: marks, dtype: int64

In [63]:
print(arr1[["marks","name"]])

   marks   name
0     20  arnav
1     20   mavi

In [64]:
print(arr1.loc[1])#accesing row with all labels

name     mavi
age        10
marks      20
Name: 1, dtype: object

In [65]:
print(arr1.iloc[0]) #accesing row using position number

name     arnav
age         10
marks       20
Name: 0, dtype: object

In [66]:
arr1["year"]=[1,1] #adding a new column
print(arr1)

    name  age  marks  year
0  arnav   10     20     1
1   mavi   10     20     1

In [67]:
arr1=arr1.drop("year",axis=1) #deleting a column axis=1 means deleting columns
print(arr1)

    name  age  marks
0  arnav   10     20
1   mavi   10     20

In [68]:
print(arr1["marks"].mean())
print(arr1["marks"].max())
print(arr1.describe())

20.0
20
        age  marks
count   2.0    2.0
mean   10.0   20.0
std     0.0    0.0
min    10.0   20.0
25%    10.0   20.0
50%    10.0   20.0
75%    10.0   20.0
max    10.0   20.0

In [76]:
data={#assignment
"student":["A","B",] ,   
"math":[85,56],
"english":[92,74],
"science":[60,90]}
arr2=pd.DataFrame(data)
print(arr2)

  student  math  english  science
0       A    85       92       60
1       B    56       74       90

In [86]:
print("average marks of maths:",arr2["math"].mean())
print("average marks of science:",arr2["science"].mean())
print("average marks of english:",arr2["english"].mean())
print("\n")

print("highest marks in maths:",arr2["math"].max())
print("\n")

arr2["total"]=arr2[["math","english","science"]].sum(axis=1)
print(arr2)
print("\n")

print("student with highest total marks:",arr2["total"].idxmax())
print("\n")

topper_index = arr2["total"].idxmax()
print("Topper student:", arr2.loc[topper_index, ["student", "total"]])

average marks of maths: 70.5
average marks of science: 75.0
average marks of english: 83.0


highest marks in maths: 85


  student  math  english  science  total
0       A    85       92       60    237
1       B    56       74       90    220


student with highest total marks: 0


Topper student: student      A
total      237
Name: 0, dtype: object

In [2]:
import pandas as pd
df=pd.read_csv("students.csv")
print(df)

    Name  Math  Science  English
0   Amit    85       88       92
1   Riya    78       81       74
2  Arjun    90       95       89
3   Neha    67       73       70

In [8]:
df.head() #first 5 rows 
print("\n")

df.tail() #last 5 rows

    Name  Math  Science  English
0   Amit    85       88       92
1   Riya    78       81       74
2  Arjun    90       95       89
3   Neha    67       73       70

In [15]:
print("shape of data:", df.shape)
print("column names:",df.columns)
df.info()#summary

shape of data: (4, 4)
column names: Index(['Name', 'Math', 'Science', 'English'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Math     4 non-null      int64
 2   Science  4 non-null      int64
 3   English  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [14]:
df.describe() #statistic summary

            Math    Science    English
count   4.000000   4.000000   4.000000
mean   80.000000  84.250000  81.250000
std     9.966611   9.429563  10.874282
min    67.000000  73.000000  70.000000
25%    75.250000  79.000000  73.000000
50%    81.500000  84.500000  81.500000
75%    86.250000  89.750000  89.750000
max    90.000000  95.000000  92.000000

In [17]:
df.isnull().sum() # check whether any misssing data

Name       0
Math       0
Science    0
English    0
dtype: int64

In [18]:
print(df.mean(numeric_only=True)) # get average marks of all numeric fields

Math       80.00
Science    84.25
English    81.25
dtype: float64

In [20]:
df.rename(columns={"Math":"mathematics"},inplace=True) #renames existing field
print(df)

    Name  mathematics  Science  English
0   Amit           85       88       92
1   Riya           78       81       74
2  Arjun           90       95       89
3   Neha           67       73       70

In [26]:
print("no of students:",df.shape[0])
print("no of subjects:",df.shape[1]-1)
print("\n")


print("subject with the max avearage marks is: ",df.mean(numeric_only=True).idxmax())

no of students: 4
no of subjects: 3


subject with the max avearage marks is:  Science

In [27]:
df["mathematics"]#select columns

0    85
1    78
2    90
3    67
Name: mathematics, dtype: int64

In [30]:
df[["Science","English"]]#select multiple columns

   Science  English
0       88       92
1       81       74
2       95       89
3       73       70

In [37]:
df.iloc[0] #first row dega and df.iloc[0:2] 2 row dega and we selecting row using label

Name           Amit
mathematics      85
Science          88
English          92
Name: 0, dtype: object

In [39]:
df.loc[1:3]# we are selecting row using position

    Name  mathematics  Science  English
1   Riya           78       81       74
2  Arjun           90       95       89
3   Neha           67       73       70

In [40]:
df[df["mathematics"]>80] # filtering

    Name  mathematics  Science  English
0   Amit           85       88       92
2  Arjun           90       95       89

In [44]:
df[(df["mathematics"]>80) | (df["Science"]>90)]

    Name  mathematics  Science  English
0   Amit           85       88       92
2  Arjun           90       95       89

In [43]:
df[(df["mathematics"]>80) & (df["Science"]>80)]

    Name  mathematics  Science  English
0   Amit           85       88       92
2  Arjun           90       95       89

In [50]:
df[df["mathematics"]==85] #  select row with marks ==85 in maths

   Name  mathematics  Science  English
0  Amit           85       88       92

In [51]:
df[df["Name"].str.startswith("A")] #select rows starting with name A

    Name  mathematics  Science  English
0   Amit           85       88       92
2  Arjun           90       95       89

In [53]:
df.sort_values(by="mathematics",ascending=True) #arranged in the asending order

    Name  mathematics  Science  English
3   Neha           67       73       70
1   Riya           78       81       74
0   Amit           85       88       92
2  Arjun           90       95       89

In [55]:
df.sort_values(by=["Science", "mathematics"],  ascending=[False, True])

    Name  mathematics  Science  English
2  Arjun           90       95       89
0   Amit           85       88       92
1   Riya           78       81       74
3   Neha           67       73       70

In [65]:
df["total"]=df[["mathematics","Science","English"]].sum(axis=1)
print(df)
result = df[(df["mathematics"] > 80) & (df["Science"] > 80) & (df["English"] > 80)]
result = result.sort_values(by="total", ascending=False)
print(result)

    Name  mathematics  Science  English  total
0   Amit           85       88       92    265
1   Riya           78       81       74    233
2  Arjun           90       95       89    274
3   Neha           67       73       70    210
    Name  mathematics  Science  English  total
2  Arjun           90       95       89    274
0   Amit           85       88       92    265

In [70]:
print(df)

    Name  mathematics  Science  English  total
0   Amit           85       88       92    265
1   Riya           78       81       74    233
2  Arjun           90       95       89    274
3   Neha           67       73       70    210

In [71]:
df.sort_values(by="total", ascending=False)

    Name  mathematics  Science  English  total
2  Arjun           90       95       89    274
0   Amit           85       88       92    265
1   Riya           78       81       74    233
3   Neha           67       73       70    210